{
  "course": [
    {
      "name": "Security Onion Essentials",
      "category": "Beginner",
      "Delivery": "Online",
      "tagline": "Designed for beginners to get started",
      "img_course_title": "Essentials_2.4_REV1.png",
      "summary": [
        "Get started by taking the FREE Security Onion 2 Essentials training.",
        "This course is a prerequisite to other courses listed."
      ],
      "info": "This is the start of your Security Onion education journey. You will learn the basics of the Security Onion platform and learn the essential details that will be required to know in future courses.",
      "registration_link": "#free-training"
    },
    {
      "name": "Security Onion in Production",
      "category": "Intermediate",
      "Delivery": "On-Demand * †",
      "tagline": "Designed for performance and value",
      "img_course_title": "SO_Prod.png",
      "summary": [
        "This course is geared for administrators of Security Onion 2.4.",
        "Students will gain a foundational understanding of the platform -",
        "how to architect, deploy, manage and tune their Security Onion 2.4 grid."      
      ],
      "info": "Administrators will build on basic concepts of standalone and distributed grid architecture; this will ensure that grid architecture will support the organizational needs. Furthermore students will learn important concepts required to manage and tune the grid to improve performance.",
      "registration_link": "https://onlinetraining.securityonionsolutions.com/p/security-onion-in-production1/"
    },
    {
      "name": "Practical Analysis",
      "category": "Intermediate",
      "Delivery": "On-Demand * †",
      "tagline": "Designed for performance and value on fiber infrastructure",
      "img_course_title": "Practical.png",
      "summary": [
        "This course is geared for those interested in seeing how Security Onion",
        "is used practically to triage alerts, hunt for threats, as well",
        "as build new detections."
      ],
      "info": "Practical analysis is a start to finish course that begins by building on alert triage concepts, investigation, threat hunting, and detection engineering. This course will build a common workflow that any analyst can adopt to progress through various real-world scenarios.",
      "registration_link": "https://onlinetraining.securityonionsolutions.com/p/practical-analysis-with-security-onion1/"
    },
    {
      "name": "Detection Engineering",
      "category": "Intermediate",
      "Delivery": "On-Demand * †",
      "tagline": "Designed for high throughput observation with full packet capture",
      "img_course_title": "detection_engineering.png",
      "summary": [
        "This course is geared for those wanting to understand how to build a",
        "Detection Playbook with Security Onion 2.4. Students will gain both",
        "a theoretical and practical understanding of building detections in",
        "Security Onion, reinforced with real-life examples from network and",
        "host datasources."
      ],
      "info": "Detection engineering will help analyst detect anamolies, malicious, or suspicious traffic with automated content matching. Once this traffic is identified, and no alerts were generated, the analyst may want to be alerted if the traffic is seen in the future. This course will explain the concepts of identifying significant datasets in real-world examples and then building a play that will alert analysts based on specific content matching.",
      "registration_link": "https://onlinetraining.securityonionsolutions.com/p/developing-your-detection-playbook-with-security-onion-2/"
    },
    {
      "name": "3-Course Bundle",
      "category": "Intermediate",
      "Delivery": "On-Demand * †",
      "tagline": "Designed for extreme performance with alerts and packet metadata",
      "img_course_title": "training.jpg",
      "summary": [
        "This course bundle contains everything you need to get up and",
        "running with Security Onion 2.4!"
      ],
      "info": "Training included in this bundle will consist of the content contained in the following courses: Security Onion in Production, Practical Analysis, and Detection Engineering. This bundle is an excellent way to improve your skills beyond beginner level.",
      "registration_link": "https://onlinetraining.securityonionsolutions.com/p/security-onion-2-4-two-course-bundle"
    },
    {
     "name": "Fundamentals",
      "category": "Intermediate",
      "Delivery": "Instructor Led * ‡",
      "tagline": "Fundamentals for Analyst and Administrators",
      "img_course_title": "fundamentals_for_analyst_and_admins.png",
      "summary": [
        "Analyst and administrators fundamental knowledge of the Security Onion",
        "platform. Students will complete case studies and labs to reenforce",
        "techniques that will allow them to navigate through various logs",
        "in order to find evil."
      ],
      "info": "This course is geared for analyst and administrators of Security Onion 2. Designed to build a solid foundation of knowledge and hands-on experience. This course expands on the Essentials course and discusses topics beyond initial installation and Security Onion Console familiarity. During this course the instructor(s) will guide students through demonstrations and in-depth case study reviews. Each student will also complete multiple case studies and labs that build knowledge through hands-on training."
    },
    {
      "name": "Analyst & Threat Hunters",
      "category": "Advanced",
      "Delivery": "Instructor Led * ‡",
      "tagline": "High volume, resilient storage with fast search performance",
      "img_course_title": "fundamentals_threat_hunters.png",
      "summary": [
        "Analyst and threat hunters will gain hands-on experience finding evil",
        "in host, network, and alert traffic."
      ],
      "info": "This hands-on course is geared for security analysts and threat hunters using the Security Onion 2 platform, with very light coverage of administration. The focus of this course is to get hands-on experience processing various attacks and understanding how to identify malicious traffic in multiple protocols. Throughout the four day course students will discuss how to utilize the platform to investigate, hunt, and remediate attacks. Students will have over ten hours of case study and review time that will help build on the fundamental knowledge gained throughout previous courses."
    },
    {
      "name": "Detection Engineering In-Depth",
      "category": "Advanced",
      "Delivery": "Instructor Led * ‡",
      "tagline": "Advanced detection engineering techniques to remove gaps in security detection.",
      "img_course_title": "detection_engineering_in_depth.png",
      "summary": [
        "Analyst and administrators will deploy detection techniques to close",
        "the gap between what is detected and what is identified in host and",
        "network traffic."
      ],
      "info": "An Advanced level course, which expands on the Detection Engineering On-Demand course, which uses multiple scenarios to reinforce analysts workflow and problem solving through an in-depth detection gap process. This course uses real-world scenarios that contain host and network traffic to ensure students are prepared to find evil in their production environment. The complex case studies and labs cover concepts of file extraction, Remote Access Tool (RAT) discovery, lateral movement, and the tools and/or techniques required to close the security gap."
    }
  ]
}
