{ "features": [
	{
		"image": "alerts.jpg",
		"header": "Alerts",
		"body": "Use our Alerts interface to review and manage alerts generated by Security Onion."
	},
	{
		"image": "hunt.jpg",
		"header": "Hunt",
		"body": "Our Hunt interface is purpose built to let you investigate events quickly and easily."
	},
	{
		"image": "detections.jpg",
		"header": "Detections",
		"body": "Manage all detection rules (Suricata, YARA, and Sigma) in a single interface. Import publically-available community rules or create custom rules. Quickly pivot from the Alerts interface to the detection that triggered the alert; then disable the detection, or add suppression, threshold, and other overrides to fine tune the detection. Includes an audit trail of all rule changes."
	},
	{
		"image": "playbooks.png",
		"header": "Playbooks",
		"body": "Follow our included playbooks, covering thousands of popular detection rules, to quickly investigate alerts and determine if they are true or false positives."
	},
	{
		"image": "pcap.jpg",
		"header": "PCAP",
		"body": "Pull packet captures from network events and analyze them within SOC, CyberChef, or your favorite external tool."
	},
	{
		"image": "cases.jpg",
		"header": "Cases",
		"body": "Our built-in Cases interface gives you an incident response platform that tightly integrates with Hunt and Alerts."
	},
	{
		"image": "dashboards.jpg",
		"header": "Dashboards",
		"body": "Use Dashboards to create your own view into your organization's network, with attractive tables, charts, and diagrams."
	},
	{
		"image": "analyzers.jpg",
		"header": "Analyzers",
		"body": "Run Analyzers against your case observables, to extract summarized information from local or remote analysis services, such as VirusTotal, SpamHaus, and more!"
	},
	{
		"video": "onionai-demo.mp4",
		"header": "Onion AI",
		"body": "Cut your investigation times into fractions of what they used to be by using the built-in security analyst assistant powered by a highly intelligent AI LLM. Security Onion Pro license required."
	},
	{
		"video": "mcp-demo.mp4",
		"header": "MCP",
		"body": "Connect your own Machine Learning models to Security Onion using our Model Context Protocol (MCP) server. Security Onion Pro license required."
	}
]
}
